using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Runtime.InteropServices;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace Islamic_App
{
    public partial class fmEnd : Form
    {
        public fmEnd()
        {
            InitializeComponent();
            CustomWindow(Color.FromArgb(128, 255, 128), Color.Black, Color.FromArgb(128, 255, 128), Handle);
        }

        private string ToBgr(Color c) => $"{c.B:X2}{c.G:X2}{c.R:X2}";

        [DllImport("DwmApi")]
        private static extern int DwmSetWindowAttribute(IntPtr hwnd, int attr, int[] attrValue, int attrSize);

        const int DWWMA_CAPTION_COLOR = 35;
        const int DWWMA_BORDER_COLOR = 34;
        const int DWMWA_TEXT_COLOR = 36;
        public void CustomWindow(Color captionColor, Color fontColor, Color borderColor, IntPtr handle)
        {
            IntPtr hWnd = handle;
            //Change caption color
            int[] caption = new int[] { int.Parse(ToBgr(captionColor), System.Globalization.NumberStyles.HexNumber) };
            DwmSetWindowAttribute(hWnd, DWWMA_CAPTION_COLOR, caption, 4);
            //Change font color
            int[] font = new int[] { int.Parse(ToBgr(fontColor), System.Globalization.NumberStyles.HexNumber) };
            DwmSetWindowAttribute(hWnd, DWMWA_TEXT_COLOR, font, 4);
            //Change border color
            int[] border = new int[] { int.Parse(ToBgr(borderColor), System.Globalization.NumberStyles.HexNumber) };
            DwmSetWindowAttribute(hWnd, DWWMA_BORDER_COLOR, border, 4);

        }

        private void fmEnd_Load(object sender, EventArgs e)
        {
            tbAdkars.Text = "اللهمّ ارحمني بالقرآن، واجعله لي إمامًا ونورًا وهدىً ورحمة، اللهمّ ذكّرني منه ما نسيت، وعلّمني منه ما جهلت، وارزقني تلاوته آناء الليل وأطراف النّهار، واجعله لي حجّةً يا ربّ العالمين. اللهمّ أصلح لي ديني الذي هو عصمة أمري، وأصلح لي دنياي التي فيها معاشي، وأصلح لي آخرتي التي فيها معادي، واجعل الحياة زيادة لي في كلّ خير، واجعل الموت راحة لي من كلّ شر. اللَّهُمَّ ذَكِّرْنِي مِنْهُ ما نسيت وَعَلِّمْنِي مِنْهُ ما جهلت وَارْزُقْنِي تِلاَوَتَهُ آنَاءَ اللَّيْلِ وَأَطْرَافَ النَّهَارِ وَاجْعَلْهُ لِي حُجَّةً يَا رَبَّ العَالَمِينَ. اللهمّ اجعل خير عمري آخره، وخير عملي خواتمه، وخير أيّامي يوم ألقاك فيه، اللهمّ إنّي أسألك عيشةً هنيّةً، وميتة سويّة، ومردًّا غير مخزٍ ولا فاضح، اللهمّ إنّي أسألك خير المسألة وخير الدعاء، وخير النّجاح، وخير العلم، وخير العمل، وخير الثّواب، وخير الحياة، وخير الممات، وثبّتني وثقّل موازيني، وحقّق أمانيي، وارفع درجاتي، وتقبّل صلاتي، واغفر لي خطيئاتي، وأسألك العلا من الجنة. اللهمّ إنّي أسألك موجبات رحمتك، وعزائم مغفرتك، والسلامة من كلّ إثمٍ، والغنيمة من كلّ برٍّ، والفوز بالجنّة، والنجاة من النار، اللهمّ أحسن عاقبتنا في الأمور كلّها، وأجرنا من خزي الدّنيا وعذاب الآخرة. اللهمّ اقسم لنا من خشيتك ما تحول به بيننا وبين معصيتك، ومن طاعتك ما تبلّغنا بها جنتك، ومن اليقين ما تهون به علينا من مصائب الدنيا، ومتّعنا بأسماعنا وأبصارنا وقوتنا ما أحييتنا، واجعله الوارث منّا، واجعل ثأرنا على من ظلمنا، وانصرنا على من عادانا، ولا تجعل مصيبتنا في ديننا، ولا تجعل الدّنيا أكبر همّنا ولا مبلغ علمنا، ولا تسلّط علينا من لا يرحمنا. اللهمّ لا تدع لنا ذنبًا إلا غفرته ولا همّاً إلّا فرّجته، ولا دَينًا إلا قضيته، ولا حاجةً من حوائج الدنيا والآخرة هي لك رضًا إلّا قضيتها يا أرحم الراحمين. اللهمّ إنّي أسألك خير المسألة، وخير الدّعاء، وخير النّجاح، وخير العلم، وخير العمل، وخير الثواب، وخير الحياة، وخير الممات، وثبّتني وثقّل موازيني، وحقّق إيماني وارفع درجتي، وتقبّل صلاتي، واغفر خطيئاتي، وأسألك العلا من الجنّة، اللهمّ اجعل القرآن لنا شفاءً وهدىً وإمامًا ورحمةً، وارزقنا تلاوته على النحو الذي يرضيك عنّا. اللهمّ لا تجعل لنا ذنبًا إلا غفرته، ولا همّاً إلا فرجته، ولا دَينًا إلا قضيته، ولا مريضاً إلا شافيته، ولا عدوّاً إلا كفيته، ولا غائبًا إلا رددته، ولا عاصٍ إلا عصمته، ولا فاسدًا إلا أصلحته، ولا ميّتاً إلا رحمته، ولا عيبًا إلا سترته، ولا عسيرًا إلا يسّرته، ولا حاجةً من حوائج الدنيا والآخرة لك فيها رضًا، ولنا فيها صلاح إلّا أعنتنا على قضائها في يسر منك وعافية برحمتك يا أرحم الرّاحمين. اللهمّ انصر عبادك المجاهدين نصرًا عزيزًا، وافتح لهم فتحًا مبينًا، اللهمّ انفعنا بما علّمتنا، وعلّمنا ما ينفعنا، اللهمّ افتح لنا بخير، واجعل عواقب أمورنا إلى خير، اللهمّ إنّا نعوذ بك من فواتح الشرّ وخواتمه، وأوّله وآخره، وباطنه وظاهره. اللهمّ لا تجعل بيننا وبينك في رزقنا أحدًا سواك، واجعلنا أغنى خلقك بك، وأفقر عبادك إليك، وهب لنا غنىً لا يطغينا، وصحّةً لا تلهينا، وأغننا عمّن أغنيته عنّا، واجعل آخر كلامنا شهادة أن لا إله إلا الله وأنّ محمدًا رسول الله، وتوفّنا وأنت راضٍ عنّا غير غضبان، واجعلنا في موقف القيامة من الذين لا خوف عليهم ولا هم يحزنون برحمتك يا أرحم الرّاحمين. ربنا آتنا في الدّنيا حسنة، وفي الآخرة حسنة، وقِنا عذاب النّار، وصلِّ الله على نبيّنا محمّد وعلى آله وأصحابه الأخيار، وسلّم تسليمًا كثيرًا.";
        }
    }
}
